/* Format string for default library name */
"%@'s Firefly on %@" = "%1$@'s Firefly on %2$@";

/* Displayed in place of server version when server is not running */
"(available when Firefly is running)" = "(available when Firefly is running)";

/* Info text for the web page button when server is not running */
"Additional configuration options are available from Firefly's built-in web page. Available when Firefly is running." = "Additional configuration options are available from Firefly's built-in web page. Available when Firefly is running.";

/* Info text for the web page button when server is running */
"Additional configuration options are available from Firefly's built-in web page. Click to open the page in your browser." = "Additional configuration options are available from Firefly's built-in web page. Click to open the page in your browser.";

/* Explanatory text for the failure-to-get-status alert */
"An unexpected error occurred when trying to get the status of the Firefly server. Please close and re-open this Preference pane, and try again." = "An unexpected error occurred when trying to get the status of the Firefly server. Please close and re-open this Preference pane, and try again.";

/* Explanatory text for the failure-to-stop alert */
"An unexpected error occurred when trying to start Firefly. Please close and re-open this Preference pane, and try again." = "An unexpected error occurred when trying to start Firefly. Please close and re-open this Preference pane, and try again.";

/* Explanatory text for the failure-to-stop alert */
"An unexpected error occurred when trying to stop Firefly. Please close and re-open this Preference pane, and try again." = "An unexpected error occurred when trying to stop Firefly. Please close and re-open this Preference pane, and try again.";

/* Label for apply button in save prompt dialog */
"Apply" = "Apply";

/* Prompt to save changes when exiting prefs pane */
"Apply configuration changes?" = "Apply configuration changes?";

/* Label for cancel button in save prompt dialog */
"Cancel" = "Cancel";

/* Status text for when Firefly state is not known */
"Checking Firefly status…" = "Checking Firefly status…";

/* The Choose button in the library browser dialog */
"Choose" = "Choose";

/* Title of the library browser dialog */
"Choose Library Location" = "Choose Library Location";

/* Explanatory text for the connection-lost alert */
"Communication has been lost with the Firefly Helper. Please close and re-open this Preference pane, and try again." = "Communication has been lost with the Firefly Helper. Please close and re-open this Preference pane, and try again.";

/* Alert message notifying the user of config error */
"Configuration error" = "Configuration error";

/* Label for dont' apply button in save prompt dialog */
"Don't Apply" = "Don't Apply";

/* Explanatory text for the failure-to-apply alert */
"Due to an unexpected error, your changes could not be applied." = "Due to an unexpected error, your changes could not be applied.";

/* Alert message notifying the user of failure to apply */
"Failed to apply changes" = "Failed to apply changes";

/* Alert message notifying the user of failure to save */
"Failed to save changes" = "Failed to save changes";

/* Explanatory text for the failure-to-apply alert */
"Firefly appears to be incorrectly installed or damaged. Please consult the documentation.\n\n" = "Firefly appears to be incorrectly installed or damaged. Please consult the documentation.\n\n";

/* Explanatory text for the failure-to-save alert */
"Firefly could not be started because your changes could not be saved" = "Firefly could not be started because your changes could not be saved";

/* Format string for error message */
"Firefly directory could not be found or created at: %@" = "Firefly directory could not be found or created at: %@";

/* Status message for Firefly */
"Firefly failed to start" = "Firefly failed to start";

/* Status message for Firefly */
"Firefly is not running" = "Firefly is not running";

/* Status message for Firefly */
"Firefly is restarting" = "Firefly is restarting";

/* Status message for Firefly */
"Firefly is running" = "Firefly is running";

/* Status message for Firefly */
"Firefly is scanning the library" = "Firefly is scanning the library";

/* Status message for Firefly */
"Firefly is starting" = "Firefly is starting";

/* Status message for Firefly */
"Firefly is stopping" = "Firefly is stopping";

/* Status message for Firefly */
"Firefly status is unknown" = "Firefly status is unknown";

/* Status message for Firefly */
"Firefly stopped unexpectedly" = "Firefly stopped unexpectedly";

/* @Alert title when port number is invalid */
"Invalid port number" = "Invalid port number";

/* Generic alert string for an invalid control */
"Invalid value" = "Invalid value";

/* Error message displayed at panel load */
"Library directory could not be found in user folder" = "Library directory could not be found in user folder";

/* Alert message notifying the user of failure to get status */
"Lost contact with Firefly Helper" = "Lost contact with Firefly Helper";

/* @Alert title when library name is invalid */
"Missing library name" = "Missing library name";

/* @Alert title when password is invalid */
"Missing password" = "Missing password";

/* Error message if library name is invalid */
"Please enter a library name" = "Please enter a library name";

/* Error message if password is empty */
"Please enter a password, or un-check the password checkbox" = "Please enter a password, or un-check the password checkbox";

/* Error message if invalid port entered */
"Please enter a port number between 1024 and 65535, or choose \"Automatic\" from the pop-up menu" = "Please enter a port number between 1024 and 65535, or choose \"Automatic\" from the pop-up menu";

/* Info text for the library browse dialog */
"Please select the folder containing your music library, then click Choose." = "Please select the folder containing your music library, then click Choose.";

/* One of several titles for the start/stop button */
"Start Firefly" = "Start Firefly";

/* One of several titles for the start/stop button */
"Stop Firefly" = "Stop Firefly";

/* Format string for error message */
"The configuration file is present, but is not writable: %@" = "The configuration file is present, but is not writable: %@";

/* Format string for error message upon invalid install */
"The Firefly installation appears to be damaged.  Unable to locate Firefly Helper." = "The Firefly installation appears to be damaged.  Unable to locate Firefly Helper.";

/* Text for missing log file */
"The log file has not been created." = "The log file has not been created.";

/* Text for empty log file */
"The log file is empty." = "The log file is empty.";

/* Format string for error message upon invalid install */
"Unable to create a default configuration file at: %@" = "Unable to create a default configuration file at: %@";

/* Error message displayed at panel load */
"Unable to find or create Application Support folder" = "Unable to find or create Application Support folder";

/* Alert message notifying the user of failure to get status */
"Unable to get server status" = "Unable to get server status";

/* Error message related to invalid config */
"Unable to read configuration information" = "Unable to read configuration information";

/* Alert message notifying the user of failure to stop */
"Unable to start Firefly" = "Unable to start Firefly";

/* Alert message notifying the user of failure to stop */
"Unable to stop Firefly" = "Unable to stop Firefly";

